package com.green.day05.ch06;

public class ObjectStudy {

    /*

    지금까지의 클래스는 main메소드를 위치시키기 위한 용도로만 사용했다.
    main메소드가 하는 역할을 나타내기 위한 네이밍(클래스명)으로 사용했다.
    즉, 객체지향을 위한 클래스를 만든 것은 아니다.
    자바 문법 학습을 위한 용도로만 사용을 했다.

    클래스(class) = 데이터(Data) + 메소드(Method)
                     속성(명사) + 메소드(동사)

    🤣 속성은 데이터를 저장하기 위한 공간(전역 변수)

    인간 - 속성: 혈액형, 생년월일, 성별, 국가, 머리색, 키, 몸무게 등...
        - 메소드: 일어난다, 소리 지른다, 잔다, 뛴다, 싸운다, 문다

        클래스를 이용해서 객체(인스턴스)를 만든다.
        만드는 행위 객체화 or 인스턴스화 라고 부른다.
        new 키워드를 사용한다.

        class          vs      객체
        문서              실체(진짜)
        아파트 설계도      아파트 설계도로 만든 아파트
        TV 설계도         TV 설계도로 만든 TV

        우리가 클래스에 적는 내용은 이 객체가 만들어졌을 때
        작동하는 방식을 적는 것이다.
        예를 들어, 이러이러한 데이터를 저장해라, 이러이러한 데이터를 변경해라. (메소드)
        그러면 데이터를 저장할 수 있는 공간도 필요하다. (속성)

     */


}
